<?xml version="1.0" ?>
<net batch="1" name="v2" version="5">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>239</dim>
					<dim>319</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="6912"/>
				<biases offset="6912" size="256"/>
			</blobs>
		</layer>
		<layer id="2" name="relu_conv1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>239</dim>
					<dim>319</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>239</dim>
					<dim>319</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>239</dim>
					<dim>319</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7168" size="147456"/>
				<biases offset="154624" size="256"/>
			</blobs>
		</layer>
		<layer id="4" name="relu_conv2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv3" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="154880" size="147456"/>
				<biases offset="302336" size="256"/>
			</blobs>
		</layer>
		<layer id="6" name="relu_conv3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv4" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="302592" size="147456"/>
				<biases offset="450048" size="256"/>
			</blobs>
		</layer>
		<layer id="8" name="_plus7" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="relu_conv4" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv5" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="450304" size="147456"/>
				<biases offset="597760" size="256"/>
			</blobs>
		</layer>
		<layer id="11" name="relu_conv5" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv6" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="598016" size="147456"/>
				<biases offset="745472" size="256"/>
			</blobs>
		</layer>
		<layer id="13" name="_plus8" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="relu_conv6" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv7" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="745728" size="147456"/>
				<biases offset="893184" size="256"/>
			</blobs>
		</layer>
		<layer id="16" name="relu_conv7" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv8" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="893440" size="147456"/>
				<biases offset="1040896" size="256"/>
			</blobs>
		</layer>
		<layer id="18" name="_plus9" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="relu_conv8" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv9" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1041152" size="147456"/>
				<biases offset="1188608" size="256"/>
			</blobs>
		</layer>
		<layer id="21" name="relu_conv9" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv10" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1188864" size="147456"/>
				<biases offset="1336320" size="256"/>
			</blobs>
		</layer>
		<layer id="23" name="relu_conv10" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv11" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1336576" size="147456"/>
				<biases offset="1484032" size="256"/>
			</blobs>
		</layer>
		<layer id="25" name="_plus10" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="relu_conv11" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv11_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1484288" size="32768"/>
				<biases offset="1517056" size="512"/>
			</blobs>
		</layer>
		<layer id="28" name="relu_conv11_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv11_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1517568" size="65536"/>
				<biases offset="1583104" size="512"/>
			</blobs>
		</layer>
		<layer id="30" name="relu_conv11_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv11_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1583616" size="2048"/>
				<biases offset="1585664" size="16"/>
			</blobs>
		</layer>
		<layer id="32" name="conv12" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1585680" size="147456"/>
				<biases offset="1733136" size="256"/>
			</blobs>
		</layer>
		<layer id="33" name="relu_conv12" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv13" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1733392" size="147456"/>
				<biases offset="1880848" size="256"/>
			</blobs>
		</layer>
		<layer id="35" name="relu_conv13" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv14" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1881104" size="147456"/>
				<biases offset="2028560" size="256"/>
			</blobs>
		</layer>
		<layer id="37" name="_plus11" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="relu_conv14" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv14_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2028816" size="32768"/>
				<biases offset="2061584" size="512"/>
			</blobs>
		</layer>
		<layer id="40" name="relu_conv14_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv14_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2062096" size="65536"/>
				<biases offset="2127632" size="512"/>
			</blobs>
		</layer>
		<layer id="42" name="relu_conv14_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv14_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2128144" size="2048"/>
				<biases offset="2130192" size="16"/>
			</blobs>
		</layer>
		<layer id="44" name="conv15" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2130208" size="294912"/>
				<biases offset="2425120" size="512"/>
			</blobs>
		</layer>
		<layer id="45" name="relu_conv15" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv16" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2425632" size="589824"/>
				<biases offset="3015456" size="512"/>
			</blobs>
		</layer>
		<layer id="47" name="relu_conv16" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv17" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3015968" size="589824"/>
				<biases offset="3605792" size="512"/>
			</blobs>
		</layer>
		<layer id="49" name="_plus12" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="relu_conv17" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv17_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3606304" size="65536"/>
				<biases offset="3671840" size="512"/>
			</blobs>
		</layer>
		<layer id="52" name="relu_conv17_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv17_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3672352" size="65536"/>
				<biases offset="3737888" size="512"/>
			</blobs>
		</layer>
		<layer id="54" name="relu_conv17_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv17_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3738400" size="2048"/>
				<biases offset="3740448" size="16"/>
			</blobs>
		</layer>
		<layer id="56" name="conv18" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3740464" size="589824"/>
				<biases offset="4330288" size="512"/>
			</blobs>
		</layer>
		<layer id="57" name="relu_conv18" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv19" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4330800" size="589824"/>
				<biases offset="4920624" size="512"/>
			</blobs>
		</layer>
		<layer id="59" name="relu_conv19" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv20" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4921136" size="589824"/>
				<biases offset="5510960" size="512"/>
			</blobs>
		</layer>
		<layer id="61" name="_plus13" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="relu_conv20" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv20_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5511472" size="65536"/>
				<biases offset="5577008" size="512"/>
			</blobs>
		</layer>
		<layer id="64" name="relu_conv20_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv20_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5577520" size="65536"/>
				<biases offset="5643056" size="512"/>
			</blobs>
		</layer>
		<layer id="66" name="relu_conv20_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv20_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5643568" size="2048"/>
				<biases offset="5645616" size="16"/>
			</blobs>
		</layer>
		<layer id="68" name="conv8_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5645632" size="32768"/>
				<biases offset="5678400" size="512"/>
			</blobs>
		</layer>
		<layer id="69" name="relu_conv8_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv8_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5678912" size="65536"/>
				<biases offset="5744448" size="512"/>
			</blobs>
		</layer>
		<layer id="71" name="relu_conv8_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv8_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5744960" size="2048"/>
				<biases offset="5747008" size="16"/>
			</blobs>
		</layer>
		<layer id="73" name="conv8_2_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5747024" size="65536"/>
				<biases offset="5812560" size="512"/>
			</blobs>
		</layer>
		<layer id="74" name="relu_conv8_2_score" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv8_3_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5813072" size="1024"/>
				<biases offset="5814096" size="8"/>
			</blobs>
		</layer>
		<layer id="76" name="softmax0" precision="FP32" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv11_2_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5814104" size="65536"/>
				<biases offset="5879640" size="512"/>
			</blobs>
		</layer>
		<layer id="78" name="relu_conv11_2_score" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv11_3_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5880152" size="1024"/>
				<biases offset="5881176" size="8"/>
			</blobs>
		</layer>
		<layer id="80" name="softmax1" precision="FP32" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv14_2_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5881184" size="65536"/>
				<biases offset="5946720" size="512"/>
			</blobs>
		</layer>
		<layer id="82" name="relu_conv14_2_score" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv14_3_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5947232" size="1024"/>
				<biases offset="5948256" size="8"/>
			</blobs>
		</layer>
		<layer id="84" name="softmax2" precision="FP32" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv17_2_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5948264" size="65536"/>
				<biases offset="6013800" size="512"/>
			</blobs>
		</layer>
		<layer id="86" name="relu_conv17_2_score" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv17_3_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6014312" size="1024"/>
				<biases offset="6015336" size="8"/>
			</blobs>
		</layer>
		<layer id="88" name="softmax3" precision="FP32" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="conv20_2_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6015344" size="65536"/>
				<biases offset="6080880" size="512"/>
			</blobs>
		</layer>
		<layer id="90" name="relu_conv20_2_score" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv20_3_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6081392" size="1024"/>
				<biases offset="6082416" size="8"/>
			</blobs>
		</layer>
		<layer id="92" name="softmax4" precision="FP32" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>6</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="3" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="3" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0"/>
		<edge from-layer="8" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="3" to-layer="13" to-port="1"/>
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="3" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="13" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="3" to-layer="21" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="22" from-port="3" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
		<edge from-layer="20" from-port="3" to-layer="25" to-port="0"/>
		<edge from-layer="24" from-port="3" to-layer="25" to-port="1"/>
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0"/>
		<edge from-layer="27" from-port="3" to-layer="28" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="3" to-layer="30" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="31" to-port="0"/>
		<edge from-layer="26" from-port="1" to-layer="32" to-port="0"/>
		<edge from-layer="32" from-port="3" to-layer="33" to-port="0"/>
		<edge from-layer="33" from-port="1" to-layer="34" to-port="0"/>
		<edge from-layer="34" from-port="3" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="36" to-port="0"/>
		<edge from-layer="32" from-port="3" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="3" to-layer="37" to-port="1"/>
		<edge from-layer="37" from-port="2" to-layer="38" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="39" to-port="0"/>
		<edge from-layer="39" from-port="3" to-layer="40" to-port="0"/>
		<edge from-layer="40" from-port="1" to-layer="41" to-port="0"/>
		<edge from-layer="41" from-port="3" to-layer="42" to-port="0"/>
		<edge from-layer="42" from-port="1" to-layer="43" to-port="0"/>
		<edge from-layer="38" from-port="1" to-layer="44" to-port="0"/>
		<edge from-layer="44" from-port="3" to-layer="45" to-port="0"/>
		<edge from-layer="45" from-port="1" to-layer="46" to-port="0"/>
		<edge from-layer="46" from-port="3" to-layer="47" to-port="0"/>
		<edge from-layer="47" from-port="1" to-layer="48" to-port="0"/>
		<edge from-layer="44" from-port="3" to-layer="49" to-port="0"/>
		<edge from-layer="48" from-port="3" to-layer="49" to-port="1"/>
		<edge from-layer="49" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="51" to-port="0"/>
		<edge from-layer="51" from-port="3" to-layer="52" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="53" to-port="0"/>
		<edge from-layer="53" from-port="3" to-layer="54" to-port="0"/>
		<edge from-layer="54" from-port="1" to-layer="55" to-port="0"/>
		<edge from-layer="50" from-port="1" to-layer="56" to-port="0"/>
		<edge from-layer="56" from-port="3" to-layer="57" to-port="0"/>
		<edge from-layer="57" from-port="1" to-layer="58" to-port="0"/>
		<edge from-layer="58" from-port="3" to-layer="59" to-port="0"/>
		<edge from-layer="59" from-port="1" to-layer="60" to-port="0"/>
		<edge from-layer="56" from-port="3" to-layer="61" to-port="0"/>
		<edge from-layer="60" from-port="3" to-layer="61" to-port="1"/>
		<edge from-layer="61" from-port="2" to-layer="62" to-port="0"/>
		<edge from-layer="62" from-port="1" to-layer="63" to-port="0"/>
		<edge from-layer="63" from-port="3" to-layer="64" to-port="0"/>
		<edge from-layer="64" from-port="1" to-layer="65" to-port="0"/>
		<edge from-layer="65" from-port="3" to-layer="66" to-port="0"/>
		<edge from-layer="66" from-port="1" to-layer="67" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="68" to-port="0"/>
		<edge from-layer="68" from-port="3" to-layer="69" to-port="0"/>
		<edge from-layer="69" from-port="1" to-layer="70" to-port="0"/>
		<edge from-layer="70" from-port="3" to-layer="71" to-port="0"/>
		<edge from-layer="71" from-port="1" to-layer="72" to-port="0"/>
		<edge from-layer="69" from-port="1" to-layer="73" to-port="0"/>
		<edge from-layer="73" from-port="3" to-layer="74" to-port="0"/>
		<edge from-layer="74" from-port="1" to-layer="75" to-port="0"/>
		<edge from-layer="75" from-port="3" to-layer="76" to-port="0"/>
		<edge from-layer="28" from-port="1" to-layer="77" to-port="0"/>
		<edge from-layer="77" from-port="3" to-layer="78" to-port="0"/>
		<edge from-layer="78" from-port="1" to-layer="79" to-port="0"/>
		<edge from-layer="79" from-port="3" to-layer="80" to-port="0"/>
		<edge from-layer="40" from-port="1" to-layer="81" to-port="0"/>
		<edge from-layer="81" from-port="3" to-layer="82" to-port="0"/>
		<edge from-layer="82" from-port="1" to-layer="83" to-port="0"/>
		<edge from-layer="83" from-port="3" to-layer="84" to-port="0"/>
		<edge from-layer="52" from-port="1" to-layer="85" to-port="0"/>
		<edge from-layer="85" from-port="3" to-layer="86" to-port="0"/>
		<edge from-layer="86" from-port="1" to-layer="87" to-port="0"/>
		<edge from-layer="87" from-port="3" to-layer="88" to-port="0"/>
		<edge from-layer="64" from-port="1" to-layer="89" to-port="0"/>
		<edge from-layer="89" from-port="3" to-layer="90" to-port="0"/>
		<edge from-layer="90" from-port="1" to-layer="91" to-port="0"/>
		<edge from-layer="91" from-port="3" to-layer="92" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.1.1-83-g28dfbfd"/>
		<cli_parameters>
			<data_type value="float"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR\v2.onnx"/>
			<input_model_is_text value="False"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
