<?xml version="1.0" ?>
<net batch="1" name="v1" version="5">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>239</dim>
					<dim>319</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="6912"/>
				<biases offset="6912" size="256"/>
			</blobs>
		</layer>
		<layer id="2" name="relu_conv1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>239</dim>
					<dim>319</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>239</dim>
					<dim>319</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>239</dim>
					<dim>319</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7168" size="147456"/>
				<biases offset="154624" size="256"/>
			</blobs>
		</layer>
		<layer id="4" name="relu_conv2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv3" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="154880" size="147456"/>
				<biases offset="302336" size="256"/>
			</blobs>
		</layer>
		<layer id="6" name="relu_conv3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv4" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="302592" size="147456"/>
				<biases offset="450048" size="256"/>
			</blobs>
		</layer>
		<layer id="8" name="_plus10" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="relu_conv4" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv5" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="450304" size="147456"/>
				<biases offset="597760" size="256"/>
			</blobs>
		</layer>
		<layer id="11" name="relu_conv5" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv6" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="598016" size="147456"/>
				<biases offset="745472" size="256"/>
			</blobs>
		</layer>
		<layer id="13" name="_plus11" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="relu_conv6" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv7" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="745728" size="147456"/>
				<biases offset="893184" size="256"/>
			</blobs>
		</layer>
		<layer id="16" name="relu_conv7" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv8" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="893440" size="147456"/>
				<biases offset="1040896" size="256"/>
			</blobs>
		</layer>
		<layer id="18" name="_plus12" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="relu_conv8" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv9" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1041152" size="147456"/>
				<biases offset="1188608" size="256"/>
			</blobs>
		</layer>
		<layer id="21" name="relu_conv9" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv10" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1188864" size="147456"/>
				<biases offset="1336320" size="256"/>
			</blobs>
		</layer>
		<layer id="23" name="_plus13" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="relu_conv10" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv10_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1336576" size="32768"/>
				<biases offset="1369344" size="512"/>
			</blobs>
		</layer>
		<layer id="26" name="relu_conv10_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv10_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1369856" size="65536"/>
				<biases offset="1435392" size="512"/>
			</blobs>
		</layer>
		<layer id="28" name="relu_conv10_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv10_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1435904" size="2048"/>
				<biases offset="1437952" size="16"/>
			</blobs>
		</layer>
		<layer id="30" name="conv11" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1437968" size="147456"/>
				<biases offset="1585424" size="256"/>
			</blobs>
		</layer>
		<layer id="31" name="relu_conv11" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv12" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1585680" size="147456"/>
				<biases offset="1733136" size="256"/>
			</blobs>
		</layer>
		<layer id="33" name="relu_conv12" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv13" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1733392" size="147456"/>
				<biases offset="1880848" size="256"/>
			</blobs>
		</layer>
		<layer id="35" name="_plus14" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="relu_conv13" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv13_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1881104" size="32768"/>
				<biases offset="1913872" size="512"/>
			</blobs>
		</layer>
		<layer id="38" name="relu_conv13_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv13_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1914384" size="65536"/>
				<biases offset="1979920" size="512"/>
			</blobs>
		</layer>
		<layer id="40" name="relu_conv13_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv13_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1980432" size="2048"/>
				<biases offset="1982480" size="16"/>
			</blobs>
		</layer>
		<layer id="42" name="conv14" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1982496" size="147456"/>
				<biases offset="2129952" size="256"/>
			</blobs>
		</layer>
		<layer id="43" name="relu_conv14" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv15" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2130208" size="147456"/>
				<biases offset="2277664" size="256"/>
			</blobs>
		</layer>
		<layer id="45" name="_plus15" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="relu_conv15" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv15_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2277920" size="32768"/>
				<biases offset="2310688" size="512"/>
			</blobs>
		</layer>
		<layer id="48" name="relu_conv15_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv15_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2311200" size="65536"/>
				<biases offset="2376736" size="512"/>
			</blobs>
		</layer>
		<layer id="50" name="relu_conv15_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv15_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2377248" size="2048"/>
				<biases offset="2379296" size="16"/>
			</blobs>
		</layer>
		<layer id="52" name="conv16" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>59</dim>
					<dim>79</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2379312" size="294912"/>
				<biases offset="2674224" size="512"/>
			</blobs>
		</layer>
		<layer id="53" name="relu_conv16" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv17" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2674736" size="589824"/>
				<biases offset="3264560" size="512"/>
			</blobs>
		</layer>
		<layer id="55" name="relu_conv17" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv18" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3265072" size="589824"/>
				<biases offset="3854896" size="512"/>
			</blobs>
		</layer>
		<layer id="57" name="_plus16" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="relu_conv18" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv18_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3855408" size="65536"/>
				<biases offset="3920944" size="512"/>
			</blobs>
		</layer>
		<layer id="60" name="relu_conv18_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv18_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3921456" size="65536"/>
				<biases offset="3986992" size="512"/>
			</blobs>
		</layer>
		<layer id="62" name="relu_conv18_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv18_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3987504" size="2048"/>
				<biases offset="3989552" size="16"/>
			</blobs>
		</layer>
		<layer id="64" name="conv19" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>29</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3989568" size="589824"/>
				<biases offset="4579392" size="512"/>
			</blobs>
		</layer>
		<layer id="65" name="relu_conv19" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv20" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4579904" size="589824"/>
				<biases offset="5169728" size="512"/>
			</blobs>
		</layer>
		<layer id="67" name="relu_conv20" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv21" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5170240" size="589824"/>
				<biases offset="5760064" size="512"/>
			</blobs>
		</layer>
		<layer id="69" name="_plus17" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="relu_conv21" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv21_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5760576" size="65536"/>
				<biases offset="5826112" size="512"/>
			</blobs>
		</layer>
		<layer id="72" name="relu_conv21_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv21_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5826624" size="65536"/>
				<biases offset="5892160" size="512"/>
			</blobs>
		</layer>
		<layer id="74" name="relu_conv21_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv21_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5892672" size="2048"/>
				<biases offset="5894720" size="16"/>
			</blobs>
		</layer>
		<layer id="76" name="conv22" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5894736" size="589824"/>
				<biases offset="6484560" size="512"/>
			</blobs>
		</layer>
		<layer id="77" name="relu_conv22" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv23" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6485072" size="589824"/>
				<biases offset="7074896" size="512"/>
			</blobs>
		</layer>
		<layer id="79" name="_plus18" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="relu_conv23" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv23_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7075408" size="65536"/>
				<biases offset="7140944" size="512"/>
			</blobs>
		</layer>
		<layer id="82" name="relu_conv23_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv23_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7141456" size="65536"/>
				<biases offset="7206992" size="512"/>
			</blobs>
		</layer>
		<layer id="84" name="relu_conv23_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv23_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7207504" size="2048"/>
				<biases offset="7209552" size="16"/>
			</blobs>
		</layer>
		<layer id="86" name="conv24" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7209568" size="589824"/>
				<biases offset="7799392" size="512"/>
			</blobs>
		</layer>
		<layer id="87" name="relu_conv24" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv25" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7799904" size="589824"/>
				<biases offset="8389728" size="512"/>
			</blobs>
		</layer>
		<layer id="89" name="_plus19" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="relu_conv25" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv25_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8390240" size="65536"/>
				<biases offset="8455776" size="512"/>
			</blobs>
		</layer>
		<layer id="92" name="relu_conv25_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv25_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8456288" size="65536"/>
				<biases offset="8521824" size="512"/>
			</blobs>
		</layer>
		<layer id="94" name="relu_conv25_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv25_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>14</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8522336" size="2048"/>
				<biases offset="8524384" size="16"/>
			</blobs>
		</layer>
		<layer id="96" name="conv8_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8524400" size="32768"/>
				<biases offset="8557168" size="512"/>
			</blobs>
		</layer>
		<layer id="97" name="relu_conv8_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv8_2_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8557680" size="65536"/>
				<biases offset="8623216" size="512"/>
			</blobs>
		</layer>
		<layer id="99" name="relu_conv8_2_bbox" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv8_3_bbox" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8623728" size="2048"/>
				<biases offset="8625776" size="16"/>
			</blobs>
		</layer>
		<layer id="101" name="conv8_2_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8625792" size="65536"/>
				<biases offset="8691328" size="512"/>
			</blobs>
		</layer>
		<layer id="102" name="relu_conv8_2_score" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv8_3_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8691840" size="1024"/>
				<biases offset="8692864" size="8"/>
			</blobs>
		</layer>
		<layer id="104" name="softmax0" precision="FP32" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="conv10_2_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8692872" size="65536"/>
				<biases offset="8758408" size="512"/>
			</blobs>
		</layer>
		<layer id="106" name="relu_conv10_2_score" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="conv10_3_score" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8758920" size="1024"/>
				<biases offset="8759944" size="8"/>
			</blobs>
		</layer>
		<layer id="108" name="softmax1" precision="FP32" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>119</dim>
					<dim>159</dim>
				</port>
			</output>
		</layer>
